Copyright Jana Schaich Borg/Attribution-NonCommercial 4.0 International (CC BY-NC 4.0)

# MySQL Exercise 7: Joining Tables with Inner Joins

Before completing these exercises, I strongly recommend that you watch the video called "What are Joins?" that describe what joins are, and how different types of joins work.

As one of the last building blocks we need to address our Dognition analysis questions, in this lesson we will learn how to combine tables using inner joins.

   
## 1. Inner Joins between 2 tables

To begin, load the sql library, connect to the Dognition database, and set the Dognition database as the default.

In [3]:
%load_ext sql
%sql mysql://studentuser:studentpw@mysqlserver/dognitiondb
%sql USE dognitiondb

0 rows affected.

[]

Recall that tables in relational databases are linked through primary keys and sometimes other fields that are common to multiple tables (as is the case with our Dognition data set).  Our goal when we execute a JOIN or make a joined table is to use those common columns to let the database figure out which rows in one table match up to which rows in another table.  Once that mapping is established using at least one common field or column, the database can pull any columns you want out of the mapped, or joined, tables and output the matched data to one common table.

An inner join is a join that outputs only rows that have an exact match in both tables being joined.

To illustrate how this works, let's find out whether dog owners that are particularly surprised by their dog's performance on Dognition tests tend to own similar breeds (or breed types, or breed groups) of dogs.  There are many ways to address this question, but let's start by focusing on the dog owners who provided at least 10 ratings for one or more of their dogs in the ratings table. Of these owners, which 200 owners reported the highest average amount of surprise at their dog's performance, and what was the breed, breed_type, and breed_group of each of these owner's dog?

The surprise ratings are stored in the reviews table.  The dog breed information is provided in the dogs table.  There are two columns that are common to both tables: user_guid and dog_guid. How do we use the common columns to combine information from the two tables? 

To join the tables, you can use a WHERE clause and add a couple of details to the FROM clause so that the database knows from what table each field in your SELECT clause comes.  

First, start by adding all the columns we want to examine to the SELECT statement:

```mySQL
SELECT dog_guid AS DogID, user_guid AS UserID, AVG(rating) AS AvgRating, 
       COUNT(rating) AS NumRatings, breed, breed_group, breed_type
```
then list all the tables from which the fields we are interested in come, separated by commas (with no comma at the end of the list):

```mySQL
FROM dogs, reviews
```
then add the other restrictions:

```mySQL
GROUP BY user_guid, dog_guid, breed, breed_group, breed_type
HAVING NumRatings >= 10
ORDER BY AvgRating DESC
LIMIT 200
```

**Try running this query and see what happens:**

In [2]:
%%sql
SELECT dog_guid AS DogID, user_guid AS UserID, AVG(rating) AS AvgRating, 
       COUNT(rating) AS NumRatings, breed, breed_group, breed_type
FROM dogs, reviews    
GROUP BY user_guid, dog_guid, breed, breed_group, breed_type
HAVING NumRatings >= 10
ORDER BY AvgRating DESC
LIMIT 200;

(_mysql_exceptions.OperationalError) (1052, "Column 'dog_guid' in field list is ambiguous") [SQL: 'SELECT dog_guid AS DogID, user_guid AS UserID, AVG(rating) AS AvgRating, \n       COUNT(rating) AS NumRatings, breed, breed_group, breed_type\nFROM dogs, reviews    \nGROUP BY user_guid, dog_guid, breed, breed_group, breed_type\nHAVING NumRatings >= 10\nORDER BY AvgRating DESC\nLIMIT 200;']

You should receive an error message stating that the identity of dog_guid and user_guid in the field list is ambiguous. The reason is that the column title exists in both tables, and MySQL doesn't know which one we want. We have to specify the table name before stating the field name, and separate the two names by a period <mark>(NOTE: read this entire section before deciding whether you want to execute this query)<mark\>:

```mySQL
SELECT dogs.dog_guid AS DogID, dogs.user_guid AS UserID, AVG(reviews.rating) AS AvgRating,     
       COUNT(reviews.rating) AS NumRatings, dogs.breed, dogs.breed_group, dogs.breed_type
FROM dogs, reviews
GROUP BY dogs.user_guid, dogs.dog_guid, dogs.breed, dogs.breed_group, dogs.breed_type
HAVING NumRatings >= 10
ORDER BY AvgRating DESC
LIMIT 200
```


You can also take advantage of aliases so that you don't have to write out the name of the tables each time.  Here I will introduce another syntax for aliases that omits the AS completely.  In this syntax, the alias is whatever word (or phrase, if you use quotation marks) follows immediately after the field or table name, separated by a space. Some people find it easier to read queries if you use the syntax without an AS to create table aliases, but retain the syntax with an AS to create field aliases (but both syntaxes work for field aliases and table aliases).  So we could write:

```mySQL
SELECT d.dog_guid AS DogID, d.user_guid AS UserID, AVG(r.rating) AS AvgRating, 
       COUNT(r.rating) AS NumRatings, d.breed, d.breed_group, d.breed_type
FROM dogs d, reviews r
GROUP BY DogID, UserID, d.breed, d.breed_group, d.breed_type
HAVING NumRatings >= 10
ORDER BY AvgRating DESC
LIMIT 200
```

I am tempted to tell you to run this query so that you will see what happens, but instead, I will explain what will happen and let you decide if you want to see what the output looks...and feels...like.  
      
There is nothing built into the database table definitions that can instruct the server how to combine the tables on its own (remember, this is how relational databases save space and remain flexible).  Further, the query as written does not tell the database how the two tables are related.  As a consequence, rather than match up the two tables according to the values in the user_id and/or dog_id column, the database will do the only thing it knows how to do which is output every single combination of the records in the dogs table with the records in the reviews table.  In other words, every single row of the dogs table will get paired with every single row of the reviews table.  This is known as a Cartesian product.  Not only will it be a heavy burden on the database to output a table that has the full length of one table multiplied times the full length of another (and frustrating to you, because the query would take a very long time to run), the output would be close to useless.

To prevent this from happening, tell the database how to relate the tables in the WHERE clause:

```mySQL
SELECT d.dog_guid AS DogID, d.user_guid AS UserID, AVG(r.rating) AS AvgRating, 
       COUNT(r.rating) AS NumRatings, d.breed, d.breed_group, d.breed_type
FROM dogs d, reviews r
WHERE d.dog_guid=r.dog_guid
GROUP BY UserID, DogID, d.breed, d.breed_group, d.breed_type
HAVING NumRatings >= 10
ORDER BY AvgRating DESC
LIMIT 200
```

To be very careful and exclude any incorrect dog_guid or user_guid entries, you can include both shared columns in the WHERE clause:

```mySQL
SELECT d.dog_guid AS DogID, d.user_guid AS UserID, AVG(r.rating) AS AvgRating, 
       COUNT(r.rating) AS NumRatings, d.breed, d.breed_group, d.breed_type
FROM dogs d, reviews r
WHERE d.dog_guid=r.dog_guid AND d.user_guid=r.user_guid
GROUP BY UserID, DogID, d.breed, d.breed_group, d.breed_type
HAVING NumRatings >= 10
ORDER BY AvgRating DESC
LIMIT 200
```

**Try running this query now:**

In [3]:
%%sql

SELECT * FROM dogs LIMIT 2;

2 rows affected.

[('female', '2011', 'Labrador Retriever', 50, 1, 0, datetime.datetime(2013, 2, 5, 3, 57, 19), datetime.datetime(2013, 7, 25, 19, 41, 49), 'charmer', None, 'Pure Breed', 'Sporting', 'fd27b272-7144-11e5-ba71-058fbc01cf0b', 'ce134e42-7144-11e5-ba71-058fbc01cf0b', '21', '28.20107581', '40609.549167', '0.004687499952', '6.7499999308', '564.0215162', '812190.98333'),
 ('male', '2007', 'Shetland Sheepdog', 20, 1, 0, datetime.datetime(2013, 2, 5, 15, 35, 9), datetime.datetime(2013, 7, 25, 19, 41, 49), 'protodog', None, 'Pure Breed', 'Herding', 'fd27b5ba-7144-11e5-ba71-058fbc01cf0b', 'ce1353d8-7144-11e5-ba71-058fbc01cf0b', '20', '0.41330713937', '595.1622807', '0.0058449074865', '8.4166667806', '7.8528356481', '11308.083333')]

In [4]:
%%sql

SELECT * FROM reviews LIMIT 2;

2 rows affected.

[(0, datetime.datetime(2014, 5, 1, 19, 8), datetime.datetime(2014, 5, 1, 19, 8), 'ce3c42ca-7144-11e5-ba71-058fbc01cf0b', 'ce3ac77e-7144-11e5-ba71-058fbc01cf0b', 'Empathy', 'Yawn Warm-up'),
 (0, datetime.datetime(2014, 5, 1, 22, 1, 36), datetime.datetime(2014, 5, 1, 22, 1, 36), 'ce2acd7e-7144-11e5-ba71-058fbc01cf0b', 'ce2aedcc-7144-11e5-ba71-058fbc01cf0b', 'Empathy', 'Eye Contact Warm-up')]

In [5]:
%%sql

SELECT  d.dog_guid AS DogID,
        d.user_guid AS UserID,
        d.breed,
        d.breed_group,
        d.breed_type,
        # New columns
        AVG(r.rating) AS AvgRating,
        COUNT(r.rating) AS NumRatings

FROM dogs d, reviews r

WHERE (d.dog_guid = r.dog_guid) AND (d.user_guid = r.user_guid)

GROUP BY UserID, DogID, d.breed, d.breed_group, d.breed_type

HAVING NumRatings >= 10

ORDER BY AvgRating DESC

LIMIT 6
;

6 rows affected.

[('fdbf39f8-7144-11e5-ba71-058fbc01cf0b', 'ce987914-7144-11e5-ba71-058fbc01cf0b', 'Canaan Dog', 'Herding', 'Pure Breed', Decimal('8.0000'), 12),
 ('fdc09a82-7144-11e5-ba71-058fbc01cf0b', 'ce99bb12-7144-11e5-ba71-058fbc01cf0b', 'Golden Doodle', None, 'Popular Hybrid', Decimal('5.0000'), 10),
 ('fdbef330-7144-11e5-ba71-058fbc01cf0b', 'ce984d2c-7144-11e5-ba71-058fbc01cf0b', 'Havanese', 'Toy', 'Pure Breed', Decimal('4.5385'), 13),
 ('fdc0518a-7144-11e5-ba71-058fbc01cf0b', 'ce99661c-7144-11e5-ba71-058fbc01cf0b', 'Mixed', None, "Mixed Breed/ Other/ I Don't Know", Decimal('3.7333'), 15),
 ('fd684cf6-7144-11e5-ba71-058fbc01cf0b', 'ce473856-7144-11e5-ba71-058fbc01cf0b', 'Labrador Retriever', 'Sporting', 'Pure Breed', Decimal('3.7222'), 18),
 ('fdbf66e4-7144-11e5-ba71-058fbc01cf0b', 'ce98b9b0-7144-11e5-ba71-058fbc01cf0b', 'Golden Retriever', 'Sporting', 'Pure Breed', Decimal('3.5000'), 14)]

The query should execute quickly.  This would NOT have been the case if you did not include the WHERE clause to combine the two tables. If you accidentally request a Cartesian product from datasets with billions of rows, you could be waiting for your query output for days (and will probably get in trouble with your database administrator).  <mark>So always remember to tell the database how to join your tables!</mark>

Let's examine our joined table a bit further.  The joined table outputted by the query above should have 38 rows, despite the fact that we set our LIMIT at 200.  The reason for this is that it turns out that a relatively small number of customers provided 10 or more reviews.  If you remove the HAVING and LIMIT BY clause from the query, you should end up with 389 rows.  **Go ahead and try it:**

In [7]:
%%sql

SELECT d.dog_guid AS DogID, d.user_guid AS UserID, d.breed, d.breed_group, d.breed_type,
        AVG(r.rating) AS AvgRating, COUNT(r.rating) AS NumRatings

FROM dogs d, reviews r

WHERE (d.dog_guid = r.dog_guid) AND (d.user_guid = r.user_guid)

GROUP BY UserID, DogID, d.breed, d.breed_group, d.breed_type

#HAVING NumRatings >= 10

ORDER BY AvgRating DESC

LIMIT 6
;

6 rows affected.

[('fdbedd14-7144-11e5-ba71-058fbc01cf0b', 'ce975994-7144-11e5-ba71-058fbc01cf0b', 'Mixed', None, "Mixed Breed/ Other/ I Don't Know", Decimal('9.0000'), 1),
 ('fdbf94de-7144-11e5-ba71-058fbc01cf0b', 'ce98cc34-7144-11e5-ba71-058fbc01cf0b', 'Pembroke Welsh Corgi', 'Herding', 'Pure Breed', Decimal('9.0000'), 2),
 ('fdbf178e-7144-11e5-ba71-058fbc01cf0b', 'ce986546-7144-11e5-ba71-058fbc01cf0b', 'Airedale Terrier', 'Terrier', 'Pure Breed', Decimal('9.0000'), 1),
 ('fdc057ac-7144-11e5-ba71-058fbc01cf0b', 'ce996b9e-7144-11e5-ba71-058fbc01cf0b', 'Mixed', None, "Mixed Breed/ Other/ I Don't Know", Decimal('9.0000'), 1),
 ('fdc121dc-7144-11e5-ba71-058fbc01cf0b', 'ce9a310a-7144-11e5-ba71-058fbc01cf0b', 'Mixed', None, "Mixed Breed/ Other/ I Don't Know", Decimal('9.0000'), 1),
 ('fdc19554-7144-11e5-ba71-058fbc01cf0b', 'ce9a8a24-7144-11e5-ba71-058fbc01cf0b', 'Miniature Pinscher', 'Toy', 'Pure Breed', Decimal('9.0000'), 1)]

It's clear from looking at this output that (A) not many customers provided ratings, and (B) when they did, they usually were not very surprised by their dog's performance.  Therefore, these ratings are probably not going to provide a lot of instructive insight into how to improve Dognition's completion rate.  However, the ratings table still provides a great opportunity to illustrate the results of different types of joins.  

To help prepare us for this:

**Questions 1-4:  How many unique dog_guids and user_guids are there in the reviews and dogs table independently?**

In [29]:
%%sql

SELECT DISTINCT dog_guid FROM dogs;
# 35050 rows affected.

35050 rows affected.
0 rows affected.

[]

In [30]:
%%sql

SELECT DISTINCT user_guid FROM dogs;
# 35050 rows affected.

30968 rows affected.
0 rows affected.

[]

In [31]:
%%sql

SELECT DISTINCT user_guid FROM reviews;
# 35050 rows affected.

5587 rows affected.
0 rows affected.

[]

In [32]:
%%sql

SELECT DISTINCT user_guid FROM reviews;
# 35050 rows affected.

5587 rows affected.
0 rows affected.

[]

These counts indicate some important things:

+ Many customers in both the reviews and the dogs table have multiple dogs
+ There are many more unique dog_guids and user_guids in the dogs table than the reviews table
+ There are many more unique dog_guids and user_guids in the reviews table than in the output of our inner join

Let's test one more thing.  
   
**Try the inner join query once with just the dog_guid or once with just the user_guid clause in the WHERE statement:**

In [33]:
%%sql

SELECT d.dog_guid, d.user_guid, r.dog_guid, r.user_guid

FROM dogs d, reviews r

WHERE (d.user_guid = r.user_guid)

;

# NIHIL

36926 rows affected.
0 rows affected.

[]

In [35]:
%%sql

SELECT d.dog_guid, d.user_guid, r.dog_guid, r.user_guid

FROM dogs d, reviews r

WHERE (d.dog_guid = r.dog_guid)

;

# XTORT

1522 rows affected.
0 rows affected.

[]

When you run the query by joining on the dog_guid only, you still get 389 rows in your output.  When you run the query by joining on the user_guid only, you get 5586 rows in your output.  This means that:

+ All of the user_guids in the reviews table are in the dogs table
+ Only 389 of the over 5000 dog_guids in the reviews table are in the dogs table

Perhaps most importantly for our current purposes, these COUNT queries show you that <mark>*inner joins only output the data from rows that have equivalent values in both tables being joined*.</mark>  If you wanted to include all the dog_guids or user_guids in one or both of the tables, you would have to use an outer join, which we will practice in the next lesson.

Try an inner join on your own.  
   

**Question 5: How would you extract the user_guid, dog_guid, breed, breed_type, and breed_group for all animals who completed the "Yawn Warm-up" game (you should get 20,845 rows if you join on dog_guid only)?**

In [36]:
%%sql

SELECT * FROM dogs LIMIT 2;

2 rows affected.

[('female', '2011', 'Labrador Retriever', 50, 1, 0, datetime.datetime(2013, 2, 5, 3, 57, 19), datetime.datetime(2013, 7, 25, 19, 41, 49), 'charmer', None, 'Pure Breed', 'Sporting', 'fd27b272-7144-11e5-ba71-058fbc01cf0b', 'ce134e42-7144-11e5-ba71-058fbc01cf0b', '21', '28.20107581', '40609.549167', '0.004687499952', '6.7499999308', '564.0215162', '812190.98333'),
 ('male', '2007', 'Shetland Sheepdog', 20, 1, 0, datetime.datetime(2013, 2, 5, 15, 35, 9), datetime.datetime(2013, 7, 25, 19, 41, 49), 'protodog', None, 'Pure Breed', 'Herding', 'fd27b5ba-7144-11e5-ba71-058fbc01cf0b', 'ce1353d8-7144-11e5-ba71-058fbc01cf0b', '20', '0.41330713937', '595.1622807', '0.0058449074865', '8.4166667806', '7.8528356481', '11308.083333')]

In [43]:
%%sql

SELECT * FROM complete_tests LIMIT 2;

2 rows affected.

[(datetime.datetime(2013, 2, 5, 18, 26, 54), datetime.datetime(2013, 2, 5, 18, 26, 54), None, 'fd27b86c-7144-11e5-ba71-058fbc01cf0b', 'Yawn Warm-up', 'Empathy'),
 (datetime.datetime(2013, 2, 5, 18, 31, 3), datetime.datetime(2013, 2, 5, 18, 31, 3), None, 'fd27b86c-7144-11e5-ba71-058fbc01cf0b', 'Yawn Game', 'Empathy')]

In [42]:
%%sql

SELECT d.user_guid, d.dog_guid, d.breed, d.breed_type, d.breed_group,
       r.user_guid, r.dog_guid, r.test_name

FROM dogs d, complete_tests r

WHERE (d.dog_guid = r.dog_guid) AND (r.test_name = 'Yawn Warm-up')

;

# ANGST

20845 rows affected.
0 rows affected.

[]

## 2. Joining More than 2 Tables

In theory, you can join as many tables together as you want or need.  To join multiple tables you take the same approach as we took when we were joining two tables together: list all the fields you want to extract in the SELECT statement, specify which table they came from in the SELECT statement, list all the tables from which you will need to extract the fields in the FROM statement, and then tell the database how to connect the tables in the WHERE statement.

To extract the user_guid, user's state of residence, user's zip code, dog_guid, breed, breed_type, and breed_group for all animals who completed the "Yawn Warm-up" game, you might be tempted to query:

```mySQL
SELECT c.user_guid AS UserID, u.state, u.zip, d.dog_guid AS DogID, d.breed, d.breed_type, d.breed_group
FROM dogs d, complete_tests c, users u
WHERE d.dog_guid=c.dog_guid 
   AND c.user_guid=u.user_guid
   AND c.test_name="Yawn Warm-up";
```
This query focuses the relationships primarily on the complete_tests table.  However, it turns out that our Dognition dataset has only NULL values in the user_guid column of the complete_tests table.  If you were to execute the query above, you would not get an error message, but your output would have 0 rows.  However, the power of relational databases will come in handy here.  You can use the dogs table to link the complete_tests and users table (pay attention to the difference between the WHERE statement in this query vs. the WHERE statement in the query above):

```mySQL
SELECT d.user_guid AS UserID, u.state, u.zip, d.dog_guid AS DogID, d.breed, d.breed_type, d.breed_group
FROM dogs d, complete_tests c, users u
WHERE d.dog_guid=c.dog_guid 
   AND d.user_guid=u.user_guid
   AND c.test_name="Yawn Warm-up";
```

Of note, joins are very resource intensive, so try not to join unnecessarily.  In general, the more joins you have to execute, the slower your query performance will be.

In [9]:
%%sql

SELECT c.user_guid AS UserID, u.state, u.zip, d.dog_guid AS DogID, d.breed, d.breed_type, d.breed_group
FROM dogs d, complete_tests c, users u
WHERE d.dog_guid=c.dog_guid 
   AND c.user_guid=u.user_guid
   AND c.test_name="Yawn Warm-up";

0 rows affected.

[]

In [12]:
%%sql

SELECT d.user_guid AS UserID, u.state, u.zip, d.dog_guid AS DogID, d.breed, d.breed_type, d.breed_group
FROM dogs d, complete_tests c, users u
WHERE d.dog_guid=c.dog_guid 
   AND d.user_guid=u.user_guid
   AND c.test_name="Yawn Warm-up"
LIMIT 5
;

5 rows affected.

[('ce134e42-7144-11e5-ba71-058fbc01cf0b', 'ND', '58201', 'fd27b272-7144-11e5-ba71-058fbc01cf0b', 'Labrador Retriever', 'Pure Breed', 'Sporting'),
 ('ce134e42-7144-11e5-ba71-058fbc01cf0b', 'ND', '58201', 'fd27b272-7144-11e5-ba71-058fbc01cf0b', 'Labrador Retriever', 'Pure Breed', 'Sporting'),
 ('ce1353d8-7144-11e5-ba71-058fbc01cf0b', 'MA', '1005', 'fd27b5ba-7144-11e5-ba71-058fbc01cf0b', 'Shetland Sheepdog', 'Pure Breed', 'Herding'),
 ('ce1353d8-7144-11e5-ba71-058fbc01cf0b', 'MA', '1005', 'fd27b5ba-7144-11e5-ba71-058fbc01cf0b', 'Shetland Sheepdog', 'Pure Breed', 'Herding'),
 ('ce135ab8-7144-11e5-ba71-058fbc01cf0b', 'CT', '6820', 'fd27b6b4-7144-11e5-ba71-058fbc01cf0b', 'Golden Retriever', 'Pure Breed', 'Sporting')]

**Question 6: How would you extract the user_guid, membership_type, and dog_guid of all the golden retrievers who completed at least 1 Dognition test (you should get 711 rows)?**

In [18]:
%%sql

# 1. Check tables

SELECT * FROM dogs LIMIT 1;             # dogs: user_guid (1), dog_guid (2), breed (3)
SELECT * FROM complete_tests LIMIT 1;   # complete_tests: user_guid (1), dog_guid (2), test_name (4)
SELECT * FROM users LIMIT 1;            # users: user_guid (1), membership_type (5)

# 2. Inner join query

SELECT  d.user_guid AS UserID,
        d.dog_guid AS DogID,
        d.breed AS Breed,
        u.membership_type AS MembershipType,
        COUNT(test_name) AS NbCompletedTests

FROM dogs d, complete_tests c, users u

WHERE   (d.dog_guid = c.dog_guid)   AND
        (d.user_guid = u.user_guid) AND
        (d.breed = "Golden Retriever")

GROUP BY UserID, DogID, Breed, MembershipType

HAVING NbCompletedTests > 0

LIMIT 5  # 5/711
;

1 rows affected.
1 rows affected.
1 rows affected.
5 rows affected.

[('ce13507c-7144-11e5-ba71-058fbc01cf0b', 'fd27b79a-7144-11e5-ba71-058fbc01cf0b', 'Golden Retriever', 1, 11),
 ('ce135ab8-7144-11e5-ba71-058fbc01cf0b', 'fd27b6b4-7144-11e5-ba71-058fbc01cf0b', 'Golden Retriever', 1, 2),
 ('ce135cf2-7144-11e5-ba71-058fbc01cf0b', 'fd7af63a-7144-11e5-ba71-058fbc01cf0b', 'Golden Retriever', 2, 80),
 ('ce1389d4-7144-11e5-ba71-058fbc01cf0b', 'fd27efb2-7144-11e5-ba71-058fbc01cf0b', 'Golden Retriever', 1, 20),
 ('ce21f122-7144-11e5-ba71-058fbc01cf0b', 'fd3d03fc-7144-11e5-ba71-058fbc01cf0b', 'Golden Retriever', 2, 4)]

## Practice inner joining your own tables!

**Question 7: How many unique Golden Retrievers who live in North Carolina are there in the Dognition database (you should get 30)?**

In [48]:
%%sql

# 1. Tables
SELECT * FROM dogs LIMIT 1;   # dog_guid (1), user_guid (2), breed (3)
SELECT * FROM users LIMIT 1;   # user_guid (2), state (4)

# 2. Inner join query (wrong one)
SELECT d.dog_guid, d.breed, d.breed_type, u.state
FROM dogs d, users u
WHERE (u.user_guid = d.user_guid) AND
      (d.breed = "Golden Retriever") AND
      (u.state = "NC")
;

# 3. Correct one
SELECT u.state AS state, d.breed AS breed, COUNT(DISTINCT d.dog_guid)
FROM users u, dogs d
WHERE d.user_guid=u.user_guid AND breed="Golden Retriever"
GROUP BY state
HAVING state="NC";

1 rows affected.
1 rows affected.
62 rows affected.
1 rows affected.

[('NC', 'Golden Retriever', 30)]

**Question 8: How many unique customers within each membership type provided reviews (there should be 2900 in the membership type with the greatest number of customers, and 15 in the membership type with the fewest number of customers if you do NOT include entries with NULL values in their ratings field)?**

In [62]:
%%sql

# 1. Tables
SELECT * FROM reviews LIMIT 1;  # user_guid, created_at
SELECT * FROM users LIMIT 1;    # user_guid, membership_type

# 2. Queries
SELECT COUNT(DISTINCT u.user_guid) AS nb_users, u.membership_type
FROM users u, reviews r
WHERE (u.user_guid = r.user_guid) AND (r.rating IS NOT NULL)
GROUP BY u.membership_type
ORDER BY nb_users DESC
;

1 rows affected.
1 rows affected.
5 rows affected.

[(2900, 1), (1120, 2), (816, 4), (238, 3), (15, 5)]

**Question 9: For which 3 dog breeds do we have the greatest amount of site_activity data, (as defined by non-NULL values in script_detail_id)(your answers should be "Mixed", "Labrador Retriever", and "Labrador Retriever-Golden Retriever Mix"?**

In [73]:
%%sql

# 1. TABLES (show tables)
SELECT * FROM site_activities LIMIT 1;     # script_detail_id, dog_guid
SELECT COUNT(script_detail_id), COUNT(*) FROM site_activities;     # 295 / 1353130

# 2. QUERIES
SELECT d.breed, COUNT(script_detail_id) AS activity
FROM dogs d, site_activities s
WHERE (d.dog_guid = s.dog_guid)
GROUP BY d.breed
HAVING activity > 0
ORDER BY activity DESC
LIMIT 10
;

1 rows affected.
1 rows affected.
10 rows affected.

[('Mixed', 93415),
 ('Labrador Retriever', 38804),
 ('Labrador Retriever-Golden Retriever Mix', 27498),
 ('Golden Retriever', 19802),
 ('Poodle', 14938),
 ('German Shepherd Dog', 13780),
 ('Golden Retriever-Labrador Retriever Mix', 10980),
 ("I Don't Know", 10518),
 ('Border Collie', 8403),
 ('Australian Shepherd', 6040)]

In [75]:
%%sql
# Answer
SELECT d.breed, COUNT(s.script_detail_id) AS activity
FROM dogs d, site_activities s
WHERE d.dog_guid=s.dog_guid AND s.script_detail_id IS NOT NULL
GROUP BY breed ORDER BY activity DESC
LIMIT 5;

5 rows affected.

[('Mixed', 93415),
 ('Labrador Retriever', 38804),
 ('Labrador Retriever-Golden Retriever Mix', 27498),
 ('Golden Retriever', 19802),
 ('Poodle', 14938)]